{ "articles": [{
    "author": "Emily Shire",
    "title": "Scott Walker Endorses Ted Cruz - And It Could Swing The Wisconsoin Primary",
    "timestamp": "an hour ago",
    "image": "http://lovelace-media.imgix.net/getty/511716288.jpg?w=684&h=513&fit=crop&crop=faces&auto=format&q=70",
    "story": "On Tuesday, former Republican presidential hopeful Wisconsin Gov. Scott Walker endorsed Ted Cruz for the party's nomination. In one week, Wisconsin voters will go to the polls for their state's primary — and it could play a decisive role in determining the Republican presidential nomination. While Donald Trump is the GOP presidential frontrunner, if Cruz wins Wisconsin, it could be a powerful, symbolic win, in addition to helping him make up for the delegate deficit. 'It was an easy call for me to support Ted Cruz,' Walker told conservative radio host Charles Sykes on Newsradio WTMJ. Walker elaborated on his decision to officially endorse Cruz, saying 'I just fundamentally believe that he's a constitutional conservative.' He also brought up multiple times that both he and Cruz were the sons of preachers. While Walker seemed to actively deflect the opportunity to criticize Trump, he stressed that he believed Cruz would work better with Wisconsin Republican voters' values. 'He stays firm. He sticks to his guns. That will go over very, very well,' Walker said of Cruz. The Wisconsin governor also made a concerted effort during his interview with Sykes to stress that this wasn't an anti-Trump endorsement, but an announcement of active support. 'To me, I'm all in. This is not a default,' Walker said. Bellicose Trump preemptively declared on Twitter less than 24 hours ago that Walker wouldn't endorse him because of 'the way I beat him.' Meanwhile, Walker took to Twitter to further explain why he was supporting Cruz, declaring he 'isn’t afraid to stand up to big govt special interests' and is in 'the best-positioned candidate to both win the Republican nomination and defeat Hillary Clinton. I’m proud to stand with him.'",
    "category": "news"
  }, {
    "author": "Dasha Fayvinova",
    "title": "This Squirrel Eating Pizza Just Joined Pizza Rat In Weird Internet Fame",
    "timestamp": "20 hours ago",
    "image": "http://lovelace-media.imgix.net/getty/516222772.jpg?w=684&h=513&fit=crop&crop=faces&auto=format&q=70",
    "story": "The only question you should be asking yourself today is: how much do you love pizza? Whatever the answer may be, I bet that your love doesn't run as deep as this squirrel eating pizza, who had to climb up a tree in order to enjoy their treat. I'm sure you enjoy pizza as much as the next Millennial — after all, it does contain every food group if you include toppings — but you have noting on this furry little Chicago native and that's a straight up fact. Andrew Goodman was on his merry way around the neighborhood when he spotted the curious site of a squirrel perched atop a tree. He then also noticed that the squirrel wasn't just sitting around, but that it was tenderly munching on America's favorite party treat — pizza. Goodman was so enamored by the sight that he took a picture because he is a wonderful human being and because his wife loves squirrels. Thank you, Andrew. The Internet welcomes you with open eyes and grease-stained keyboards. Actually, the real MVP has to be Melissa McEwen, Andrew Goodman's friend who posted the picture on her Twitter account. It was her post that got the attention of ABC7 Chicago, which ran the story for us to enjoy. Now we get to see this adorable little creature and completely relate to it on a whole other level. I feel like this squirrel is just a past life I had lived through. After all, I can totally see myself climbing on a tree and eating pizza. Hold on, Mr. Squirrel, I'll be up there within the hour to join you for lunch. Here is the picture. Look at it. Admire it. Understand it. The animal answer to NYC's Pizza Rat is here, and it's a Chicago squirrel. I would like to point out, and possibly regret later, that the pizza in question is not deep dish. I guess it goes to show you that the pizza turf war has been called off and the answer to the ultimate pizza question, NYC versus Chicago, has been given. If your own squirrel wants a slice of that thin crust, who are we to argue. (Deep dish pizza is delicious, and I'm sure if it was an option the squirrel would go for it in a heartbeat.) Here are some other now 'famous' animals who are also really good at eating food.",
    "category": "lifestyle"
    }, {
    "author": "Lily Feinn",
    "title": "This Ball Pit For Drunk Adults Is The '90s Throwback Celebration We All Deserve — VIDEO",
    "timestamp": "22 hours ago",
    "image": "http://lovelace-media.imgix.net/uploads/1406/371ad310-d4da-0133-b11f-0a98e7c0bc93.jpg?w=684&h=513&fit=crop&crop=faces&auto=format&q=70",
    "story": "Fantasy became a reality earlier this month when San Francisco debuted its first pop up ball pit for drunk adults. Ryan Lum, founder of Forward Motion San Francisco, officially achieved greatness when he filled a bar with 40,000 multicolored plastic balls the weekend of March 19. West Coast residents paid a $30 entrance fee in an attempt to relive childhood memories, forgo adult responsibilities, and forget about work in the morning. For a brief shining moment, there existed the opportunity to be tipsy in a room full of plastic balls, and all was right in the world. Forward Motion, a not-for-profit specializing in creating events that help people leave their comfort zone and “live out their dreams,” was launched by Lum in 2015. They've hosted many events that harken back to the carefree joys of childhood, including games of messy Twister and massive water fights. They encourage you to 'cross another item off your bucket list' — especially if it involves partying like it's 1995. After speaking with the owner of Romper Room, a funky cocktail lounge in Union Square area, Lum came up with the brilliant idea to mix the classic ball pit with booze. He knew the results would be magic. However, drumming up interest and the funds to match wasn’t all smooth sailing. 'It took a little over a year to actually make it happen as the biggest obstacle was trying to raise enough money to purchase 40,000 ball pit balls,' Lum wrote to Mashable. 'After several failed crowdfunding attempts, I decided to just start selling tickets to [the] event that didn’t even exist. It took a long time trying to raise the money but it was all worth it in the end.' But the nostalgia didn't stop at the creation of the ball pit: 'It was also hilarious to see everyone dancing the Macarena, singing the Backstreet Boys, having ball fights with the upstairs crowds, forming conga lines, and [playing] a limbo game,' Lum told Mashable. There were more costumes, games, and merriment than a middle school halloween party, Lum added. 'It got weird.' While some might shrink at the thought of room full of sticky, sweaty balls, Lum declared the event a success. 'I talked to many of the attendees as they left the ball pit with a huge smile on their faces... People loved the idea [and] wanted to know if there will be more.' For those bemoaning cruel fate for missing the first ball party, Mashable reported that there will be a reprise event at the San Francisco nightclub Monarch in April. And, if Lum has it his way, soon a pop up ball pit party may even be coming to a city near you! Just don't start pre-gaming for it now...",
    "category": "lifestyle"
  }]
}
